
## Plan Result (stg)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 21 to add, 2 to change, 21 to destroy.</code></pre>

* Create
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/fonts/bold-affa96571d-v2.woff&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/fonts/bold-b542beb274-v2.woff2&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/fonts/light-94a07e06a1-v2.woff2&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/fonts/light-f591b13f7d-v2.woff&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/favicon.ico&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/favicon.svg&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/govuk-crest-2x.png&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/govuk-crest.png&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/govuk-icon-180.png&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/govuk-icon-192.png&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/govuk-icon-512.png&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/govuk-icon-mask.svg&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/govuk-opengraph-image.png&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/manifest.json&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/css/govuk-frontend-5.2.0.min.css&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/css/govuk-frontend-5.2.0.min.css.map&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/css/main.css&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/js/b2c.js&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/js/govuk-frontend-5.2.0.min.js&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/js/govuk-frontend-5.2.0.min.js.map&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/template.html&#34;]
* Update
  * module.data_gateway_vm[0].azurerm_windows_virtual_machine.winvm[0]
  * module.data_gateway_vm[1].azurerm_windows_virtual_machine.winvm[0]
* Delete
  * azurerm_storage_blob.b2c_config[&#34;b2c.js&#34;]
  * azurerm_storage_blob.b2c_config[&#34;bold-affa96571d-v2.woff&#34;]
  * azurerm_storage_blob.b2c_config[&#34;bold-b542beb274-v2.woff2&#34;]
  * azurerm_storage_blob.b2c_config[&#34;favicon.ico&#34;]
  * azurerm_storage_blob.b2c_config[&#34;favicon.svg&#34;]
  * azurerm_storage_blob.b2c_config[&#34;govuk-crest-2x.png&#34;]
  * azurerm_storage_blob.b2c_config[&#34;govuk-crest.png&#34;]
  * azurerm_storage_blob.b2c_config[&#34;govuk-frontend-5.2.0.min.css&#34;]
  * azurerm_storage_blob.b2c_config[&#34;govuk-frontend-5.2.0.min.css.map&#34;]
  * azurerm_storage_blob.b2c_config[&#34;govuk-frontend-5.2.0.min.js&#34;]
  * azurerm_storage_blob.b2c_config[&#34;govuk-frontend-5.2.0.min.js.map&#34;]
  * azurerm_storage_blob.b2c_config[&#34;govuk-icon-180.png&#34;]
  * azurerm_storage_blob.b2c_config[&#34;govuk-icon-192.png&#34;]
  * azurerm_storage_blob.b2c_config[&#34;govuk-icon-512.png&#34;]
  * azurerm_storage_blob.b2c_config[&#34;govuk-icon-mask.svg&#34;]
  * azurerm_storage_blob.b2c_config[&#34;govuk-opengraph-image.png&#34;]
  * azurerm_storage_blob.b2c_config[&#34;light-94a07e06a1-v2.woff2&#34;]
  * azurerm_storage_blob.b2c_config[&#34;light-f591b13f7d-v2.woff&#34;]
  * azurerm_storage_blob.b2c_config[&#34;main.css&#34;]
  * azurerm_storage_blob.b2c_config[&#34;manifest.json&#34;]
  * azurerm_storage_blob.b2c_config[&#34;template.html&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_storage_blob.b2c_config["b2c.js"] will be destroyed
  # (because key ["b2c.js"] is not in for_each map)
  - resource "azurerm_storage_blob" "b2c_config" {
      - access_tier            = "Hot" -> null
      - content_md5            = "ab1337886ec4d6f49ae584394527f2ef" -> null
      - content_type           = "application/javascript" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/b2c.js" -> null
      - metadata               = {} -> null
      - name                   = "b2c.js" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/views/js/b2c.js" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/b2c.js" -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/fonts/bold-affa96571d-v2.woff"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "affa96571d94a9ab7d95b0850b26edde"
      + content_type           = "font/woff"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "b2c/views/assets/fonts/bold-affa96571d-v2.woff"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/assets/fonts/bold-affa96571d-v2.woff"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/fonts/bold-b542beb274-v2.woff2"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "b542beb2746ca0e4a5a9aa7ea7767df7"
      + content_type           = "font/woff2"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "b2c/views/assets/fonts/bold-b542beb274-v2.woff2"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/assets/fonts/bold-b542beb274-v2.woff2"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/fonts/light-94a07e06a1-v2.woff2"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "94a07e06a104e76fe40583f74b204aee"
      + content_type           = "font/woff2"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "b2c/views/assets/fonts/light-94a07e06a1-v2.woff2"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/assets/fonts/light-94a07e06a1-v2.woff2"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/fonts/light-f591b13f7d-v2.woff"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "f591b13f7daad512cf0dfa0ddcb2960e"
      + content_type           = "font/woff"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "b2c/views/assets/fonts/light-f591b13f7d-v2.woff"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/assets/fonts/light-f591b13f7d-v2.woff"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/favicon.ico"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "a90776c99cc9bf3d9dbe593284d6bbf6"
      + content_type           = "image/x-ico"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "b2c/views/assets/images/favicon.ico"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/assets/images/favicon.ico"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/favicon.svg"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "e1321ba525137ed156ed48e69369531c"
      + content_type           = "image/svg+xml"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "b2c/views/assets/images/favicon.svg"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/assets/images/favicon.svg"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/govuk-crest-2x.png"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "57a05afc1fc634420a02ff0151675de0"
      + content_type           = "image/png"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "b2c/views/assets/images/govuk-crest-2x.png"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/assets/images/govuk-crest-2x.png"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/govuk-crest.png"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "bcd5768bd7721641ee71ba103bb38900"
      + content_type           = "image/png"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "b2c/views/assets/images/govuk-crest.png"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/assets/images/govuk-crest.png"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/govuk-icon-180.png"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "ae577696a9d0466ee2019f46ec4c684f"
      + content_type           = "image/png"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "b2c/views/assets/images/govuk-icon-180.png"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/assets/images/govuk-icon-180.png"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/govuk-icon-192.png"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "2c48a90c9944fc69e87574d06646f3ec"
      + content_type           = "image/png"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "b2c/views/assets/images/govuk-icon-192.png"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/assets/images/govuk-icon-192.png"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/govuk-icon-512.png"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "eef7f360c29c4ef113b058b4d7677550"
      + content_type           = "image/png"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "b2c/views/assets/images/govuk-icon-512.png"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/assets/images/govuk-icon-512.png"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/govuk-icon-mask.svg"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "ff75b23964656ce28eece43f266d9f1d"
      + content_type           = "image/svg+xml"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "b2c/views/assets/images/govuk-icon-mask.svg"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/assets/images/govuk-icon-mask.svg"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/govuk-opengraph-image.png"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "08c923d1fcc2fe3e69e73bfbf539fa6f"
      + content_type           = "image/png"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "b2c/views/assets/images/govuk-opengraph-image.png"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/assets/images/govuk-opengraph-image.png"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/manifest.json"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "77bfa2d75a6f14154f13588014ee25f6"
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "b2c/views/assets/manifest.json"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/assets/manifest.json"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/css/govuk-frontend-5.2.0.min.css"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "de9cc2127dd5a03ed66338406cf6c276"
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "b2c/views/css/govuk-frontend-5.2.0.min.css"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/css/govuk-frontend-5.2.0.min.css"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/css/govuk-frontend-5.2.0.min.css.map"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "9509139712f25775a153a8cee0d9c736"
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "b2c/views/css/govuk-frontend-5.2.0.min.css.map"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/css/govuk-frontend-5.2.0.min.css.map"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/css/main.css"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "9b303a389078a71c9f52e7f58f90e510"
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "b2c/views/css/main.css"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/css/main.css"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/js/b2c.js"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "ab1337886ec4d6f49ae584394527f2ef"
      + content_type           = "application/javascript"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "b2c/views/js/b2c.js"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/js/b2c.js"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/js/govuk-frontend-5.2.0.min.js"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "b20d2e74fe816b4da5e7fc6a26b54b25"
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "b2c/views/js/govuk-frontend-5.2.0.min.js"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/js/govuk-frontend-5.2.0.min.js"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/js/govuk-frontend-5.2.0.min.js.map"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "7c42cc5ccbfbde50efefdc697bcb4cc9"
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "b2c/views/js/govuk-frontend-5.2.0.min.js.map"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/js/govuk-frontend-5.2.0.min.js.map"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/template.html"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "9b89e48f6e6ed9d984b5a87f55e27b5f"
      + content_type           = "text/html"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "b2c/views/template.html"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/template.html"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["bold-affa96571d-v2.woff"] will be destroyed
  # (because key ["bold-affa96571d-v2.woff"] is not in for_each map)
  - resource "azurerm_storage_blob" "b2c_config" {
      - access_tier            = "Hot" -> null
      - content_md5            = "affa96571d94a9ab7d95b0850b26edde" -> null
      - content_type           = "font/woff" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/bold-affa96571d-v2.woff" -> null
      - metadata               = {} -> null
      - name                   = "bold-affa96571d-v2.woff" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/views/assets/fonts/bold-affa96571d-v2.woff" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/bold-affa96571d-v2.woff" -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["bold-b542beb274-v2.woff2"] will be destroyed
  # (because key ["bold-b542beb274-v2.woff2"] is not in for_each map)
  - resource "azurerm_storage_blob" "b2c_config" {
      - access_tier            = "Hot" -> null
      - content_md5            = "b542beb2746ca0e4a5a9aa7ea7767df7" -> null
      - content_type           = "font/woff2" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/bold-b542beb274-v2.woff2" -> null
      - metadata               = {} -> null
      - name                   = "bold-b542beb274-v2.woff2" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/views/assets/fonts/bold-b542beb274-v2.woff2" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/bold-b542beb274-v2.woff2" -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["favicon.ico"] will be destroyed
  # (because key ["favicon.ico"] is not in for_each map)
  - resource "azurerm_storage_blob" "b2c_config" {
      - access_tier            = "Hot" -> null
      - content_md5            = "a90776c99cc9bf3d9dbe593284d6bbf6" -> null
      - content_type           = "image/x-ico" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/favicon.ico" -> null
      - metadata               = {} -> null
      - name                   = "favicon.ico" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/views/assets/images/favicon.ico" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/favicon.ico" -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["favicon.svg"] will be destroyed
  # (because key ["favicon.svg"] is not in for_each map)
  - resource "azurerm_storage_blob" "b2c_config" {
      - access_tier            = "Hot" -> null
      - content_md5            = "e1321ba525137ed156ed48e69369531c" -> null
      - content_type           = "image/svg+xml" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/favicon.svg" -> null
      - metadata               = {} -> null
      - name                   = "favicon.svg" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/views/assets/images/favicon.svg" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/favicon.svg" -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["govuk-crest-2x.png"] will be destroyed
  # (because key ["govuk-crest-2x.png"] is not in for_each map)
  - resource "azurerm_storage_blob" "b2c_config" {
      - access_tier            = "Hot" -> null
      - content_md5            = "57a05afc1fc634420a02ff0151675de0" -> null
      - content_type           = "image/png" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-crest-2x.png" -> null
      - metadata               = {} -> null
      - name                   = "govuk-crest-2x.png" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/views/assets/images/govuk-crest-2x.png" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-crest-2x.png" -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["govuk-crest.png"] will be destroyed
  # (because key ["govuk-crest.png"] is not in for_each map)
  - resource "azurerm_storage_blob" "b2c_config" {
      - access_tier            = "Hot" -> null
      - content_md5            = "bcd5768bd7721641ee71ba103bb38900" -> null
      - content_type           = "image/png" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-crest.png" -> null
      - metadata               = {} -> null
      - name                   = "govuk-crest.png" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/views/assets/images/govuk-crest.png" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-crest.png" -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["govuk-frontend-5.2.0.min.css"] will be destroyed
  # (because key ["govuk-frontend-5.2.0.min.css"] is not in for_each map)
  - resource "azurerm_storage_blob" "b2c_config" {
      - access_tier            = "Hot" -> null
      - content_md5            = "de9cc2127dd5a03ed66338406cf6c276" -> null
      - content_type           = "application/octet-stream" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-frontend-5.2.0.min.css" -> null
      - metadata               = {} -> null
      - name                   = "govuk-frontend-5.2.0.min.css" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/views/css/govuk-frontend-5.2.0.min.css" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-frontend-5.2.0.min.css" -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["govuk-frontend-5.2.0.min.css.map"] will be destroyed
  # (because key ["govuk-frontend-5.2.0.min.css.map"] is not in for_each map)
  - resource "azurerm_storage_blob" "b2c_config" {
      - access_tier            = "Hot" -> null
      - content_md5            = "9509139712f25775a153a8cee0d9c736" -> null
      - content_type           = "application/octet-stream" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-frontend-5.2.0.min.css.map" -> null
      - metadata               = {} -> null
      - name                   = "govuk-frontend-5.2.0.min.css.map" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/views/css/govuk-frontend-5.2.0.min.css.map" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-frontend-5.2.0.min.css.map" -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["govuk-frontend-5.2.0.min.js"] will be destroyed
  # (because key ["govuk-frontend-5.2.0.min.js"] is not in for_each map)
  - resource "azurerm_storage_blob" "b2c_config" {
      - access_tier            = "Hot" -> null
      - content_md5            = "b20d2e74fe816b4da5e7fc6a26b54b25" -> null
      - content_type           = "application/octet-stream" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-frontend-5.2.0.min.js" -> null
      - metadata               = {} -> null
      - name                   = "govuk-frontend-5.2.0.min.js" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/views/js/govuk-frontend-5.2.0.min.js" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-frontend-5.2.0.min.js" -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["govuk-frontend-5.2.0.min.js.map"] will be destroyed
  # (because key ["govuk-frontend-5.2.0.min.js.map"] is not in for_each map)
  - resource "azurerm_storage_blob" "b2c_config" {
      - access_tier            = "Hot" -> null
      - content_md5            = "7c42cc5ccbfbde50efefdc697bcb4cc9" -> null
      - content_type           = "application/octet-stream" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-frontend-5.2.0.min.js.map" -> null
      - metadata               = {} -> null
      - name                   = "govuk-frontend-5.2.0.min.js.map" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/views/js/govuk-frontend-5.2.0.min.js.map" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-frontend-5.2.0.min.js.map" -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["govuk-icon-180.png"] will be destroyed
  # (because key ["govuk-icon-180.png"] is not in for_each map)
  - resource "azurerm_storage_blob" "b2c_config" {
      - access_tier            = "Hot" -> null
      - content_md5            = "ae577696a9d0466ee2019f46ec4c684f" -> null
      - content_type           = "image/png" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-icon-180.png" -> null
      - metadata               = {} -> null
      - name                   = "govuk-icon-180.png" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/views/assets/images/govuk-icon-180.png" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-icon-180.png" -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["govuk-icon-192.png"] will be destroyed
  # (because key ["govuk-icon-192.png"] is not in for_each map)
  - resource "azurerm_storage_blob" "b2c_config" {
      - access_tier            = "Hot" -> null
      - content_md5            = "2c48a90c9944fc69e87574d06646f3ec" -> null
      - content_type           = "image/png" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-icon-192.png" -> null
      - metadata               = {} -> null
      - name                   = "govuk-icon-192.png" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/views/assets/images/govuk-icon-192.png" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-icon-192.png" -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["govuk-icon-512.png"] will be destroyed
  # (because key ["govuk-icon-512.png"] is not in for_each map)
  - resource "azurerm_storage_blob" "b2c_config" {
      - access_tier            = "Hot" -> null
      - content_md5            = "eef7f360c29c4ef113b058b4d7677550" -> null
      - content_type           = "image/png" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-icon-512.png" -> null
      - metadata               = {} -> null
      - name                   = "govuk-icon-512.png" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/views/assets/images/govuk-icon-512.png" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-icon-512.png" -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["govuk-icon-mask.svg"] will be destroyed
  # (because key ["govuk-icon-mask.svg"] is not in for_each map)
  - resource "azurerm_storage_blob" "b2c_config" {
      - access_tier            = "Hot" -> null
      - content_md5            = "ff75b23964656ce28eece43f266d9f1d" -> null
      - content_type           = "image/svg+xml" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-icon-mask.svg" -> null
      - metadata               = {} -> null
      - name                   = "govuk-icon-mask.svg" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/views/assets/images/govuk-icon-mask.svg" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-icon-mask.svg" -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["govuk-opengraph-image.png"] will be destroyed
  # (because key ["govuk-opengraph-image.png"] is not in for_each map)
  - resource "azurerm_storage_blob" "b2c_config" {
      - access_tier            = "Hot" -> null
      - content_md5            = "08c923d1fcc2fe3e69e73bfbf539fa6f" -> null
      - content_type           = "image/png" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-opengraph-image.png" -> null
      - metadata               = {} -> null
      - name                   = "govuk-opengraph-image.png" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/views/assets/images/govuk-opengraph-image.png" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-opengraph-image.png" -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["light-94a07e06a1-v2.woff2"] will be destroyed
  # (because key ["light-94a07e06a1-v2.woff2"] is not in for_each map)
  - resource "azurerm_storage_blob" "b2c_config" {
      - access_tier            = "Hot" -> null
      - content_md5            = "94a07e06a104e76fe40583f74b204aee" -> null
      - content_type           = "font/woff2" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/light-94a07e06a1-v2.woff2" -> null
      - metadata               = {} -> null
      - name                   = "light-94a07e06a1-v2.woff2" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/views/assets/fonts/light-94a07e06a1-v2.woff2" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/light-94a07e06a1-v2.woff2" -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["light-f591b13f7d-v2.woff"] will be destroyed
  # (because key ["light-f591b13f7d-v2.woff"] is not in for_each map)
  - resource "azurerm_storage_blob" "b2c_config" {
      - access_tier            = "Hot" -> null
      - content_md5            = "f591b13f7daad512cf0dfa0ddcb2960e" -> null
      - content_type           = "font/woff" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/light-f591b13f7d-v2.woff" -> null
      - metadata               = {} -> null
      - name                   = "light-f591b13f7d-v2.woff" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/views/assets/fonts/light-f591b13f7d-v2.woff" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/light-f591b13f7d-v2.woff" -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["main.css"] will be destroyed
  # (because key ["main.css"] is not in for_each map)
  - resource "azurerm_storage_blob" "b2c_config" {
      - access_tier            = "Hot" -> null
      - content_md5            = "9b303a389078a71c9f52e7f58f90e510" -> null
      - content_type           = "application/octet-stream" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/main.css" -> null
      - metadata               = {} -> null
      - name                   = "main.css" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/views/css/main.css" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/main.css" -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["manifest.json"] will be destroyed
  # (because key ["manifest.json"] is not in for_each map)
  - resource "azurerm_storage_blob" "b2c_config" {
      - access_tier            = "Hot" -> null
      - content_md5            = "77bfa2d75a6f14154f13588014ee25f6" -> null
      - content_type           = "application/octet-stream" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/manifest.json" -> null
      - metadata               = {} -> null
      - name                   = "manifest.json" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/views/assets/manifest.json" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/manifest.json" -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["template.html"] will be destroyed
  # (because key ["template.html"] is not in for_each map)
  - resource "azurerm_storage_blob" "b2c_config" {
      - access_tier            = "Hot" -> null
      - content_md5            = "9b89e48f6e6ed9d984b5a87f55e27b5f" -> null
      - content_type           = "text/html" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/template.html" -> null
      - metadata               = {} -> null
      - name                   = "template.html" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/views/template.html" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/template.html" -> null
        # (2 unchanged attributes hidden)
    }

  # module.data_gateway_vm[0].azurerm_windows_virtual_machine.winvm[0] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "winvm" {
        id                                                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/dg-vm1-stg"
        name                                                   = "dg-vm1-stg"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (41 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_gateway_vm[1].azurerm_windows_virtual_machine.winvm[0] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "winvm" {
        id                                                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/dg-vm2-stg"
        name                                                   = "dg-vm2-stg"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (41 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 21 to add, 2 to change, 21 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":801,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->